; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-2-1-7-158)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	truck1 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p5-0 - location
	p5-1 - location
	p5-3 - location
	p4-5 - location
	p3-4 - location
	p1-0 - location
	p1-3 - location
	p1-4 - location
	p2-4 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s3)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at package1 s5)
	(at package2 s5)
	(at package3 s3)
	(at package4 s2)
	(at package5 s4)
	(at package6 s3)
	(at package7 s3)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 1)
	(= (time-to-walk p5-0 s5) 1)
	(= (time-to-walk s0 p5-0) 6)
	(= (time-to-walk p5-0 s0) 6)
	(path s5 p5-1)
	(path p5-1 s5)
	(path s1 p5-1)
	(path p5-1 s1)
	(= (time-to-walk s5 p5-1) 7)
	(= (time-to-walk p5-1 s5) 7)
	(= (time-to-walk s1 p5-1) 3)
	(= (time-to-walk p5-1 s1) 3)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(= (time-to-walk s5 p5-3) 6)
	(= (time-to-walk p5-3 s5) 6)
	(= (time-to-walk s3 p5-3) 3)
	(= (time-to-walk p5-3 s3) 3)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 6)
	(= (time-to-walk p4-5 s4) 6)
	(= (time-to-walk s5 p4-5) 6)
	(= (time-to-walk p4-5 s5) 6)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 4)
	(= (time-to-walk p3-4 s3) 4)
	(= (time-to-walk s4 p3-4) 3)
	(= (time-to-walk p3-4 s4) 3)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 5)
	(= (time-to-walk p1-0 s1) 5)
	(= (time-to-walk s0 p1-0) 1)
	(= (time-to-walk p1-0 s0) 1)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(= (time-to-walk s1 p1-3) 1)
	(= (time-to-walk p1-3 s1) 1)
	(= (time-to-walk s3 p1-3) 2)
	(= (time-to-walk p1-3 s3) 2)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(= (time-to-walk s1 p1-4) 2)
	(= (time-to-walk p1-4 s1) 2)
	(= (time-to-walk s4 p1-4) 5)
	(= (time-to-walk p1-4 s4) 5)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 2)
	(= (time-to-walk p2-4 s2) 2)
	(= (time-to-walk s4 p2-4) 7)
	(= (time-to-walk p2-4 s4) 7)
	(link s4 s0)
	(link s0 s4)
	(= (time-to-drive s4 s0) 7)
	(= (time-to-drive s0 s4) 7)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 6)
	(= (time-to-drive s3 s4) 6)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 6)
	(= (time-to-drive s5 s4) 6)
	(link s2 s4)
	(link s4 s2)
	(= (time-to-drive s2 s4) 2)
	(= (time-to-drive s4 s2) 2)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 3)
	(= (time-to-drive s0 s3) 3)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 1)
	(= (time-to-drive s0 s1) 1)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 6)
	(= (time-to-drive s3 s1) 6)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 5)
	(= (time-to-drive s4 s1) 5)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 7)
	(= (time-to-drive s0 s5) 7)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 5)
	(= (time-to-drive s3 s5) 5)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver2 s2)
	(at package1 s1)
	(at package2 s2)
	(at package3 s1)
	(at package5 s0)
	(at package6 s2)
	(at package7 s1)
	))

(:metric minimize (+ (* 4 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (walk driver2 s3 p3-4)
   deleted: (at driver2 s3)
   added: (at driver2 p3-4)
   goals met: 0 of 8
2. (walk driver2 p3-4 s4)
   deleted: (at driver2 p3-4)
   added: (at driver2 s4)
   goals met: 0 of 8
3. (walk driver2 s4 p2-4)
   deleted: (at driver2 s4)
   added: (at driver2 p2-4)
   goals met: 0 of 8
4. (walk driver2 p2-4 s2)
   deleted: (at driver2 p2-4)
   added: (at driver2 s2)
   goals met: 1 of 8
5. (walk driver1 s1 p1-4)
   deleted: (at driver1 s1)
   added: (at driver1 p1-4)
   goals met: 1 of 8
6. (walk driver1 p1-4 s4)
   deleted: (at driver1 p1-4)
   added: (at driver1 s4)
   goals met: 1 of 8
7. (walk driver1 s4 p2-4)
   deleted: (at driver1 s4)
   added: (at driver1 p2-4)
   goals met: 1 of 8
8. (walk driver1 p2-4 s2)
   deleted: (at driver1 p2-4)
   added: (at driver1 s2)
   goals met: 2 of 8
9. (board-truck driver2 truck1 s2)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 1 of 8
10. (drive-truck truck1 s2 s4 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   changed: (fuel-used) from 0 to 20
   goals met: 1 of 8
11. (load-truck package5 truck1 s4)
   deleted: (at package5 s4)
   added: (in package5 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 1 of 8
12. (drive-truck truck1 s4 s0 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s0)
   changed: (fuel-used) from 20 to 97
   goals met: 1 of 8
13. (unload-truck package5 truck1 s0)
   deleted: (in package5 truck1)
   added: (at package5 s0)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 2 of 8
14. (drive-truck truck1 s0 s5 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   changed: (fuel-used) from 97 to 167
   goals met: 2 of 8
15. (load-truck package1 truck1 s5)
   deleted: (at package1 s5)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 2 of 8
16. (load-truck package2 truck1 s5)
   deleted: (at package2 s5)
   added: (in package2 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 2 of 8
17. (drive-truck truck1 s5 s3 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (fuel-used) from 167 to 232
   goals met: 2 of 8
18. (load-truck package3 truck1 s3)
   deleted: (at package3 s3)
   added: (in package3 truck1)
   changed: (load truck1) from 2 to 3, (fuel-per-minute truck1) from 13 to 16
   goals met: 2 of 8
19. (load-truck package6 truck1 s3)
   deleted: (at package6 s3)
   added: (in package6 truck1)
   changed: (load truck1) from 3 to 4, (fuel-per-minute truck1) from 16 to 20
   goals met: 2 of 8
20. (load-truck package7 truck1 s3)
   deleted: (at package7 s3)
   added: (in package7 truck1)
   changed: (load truck1) from 4 to 5, (fuel-per-minute truck1) from 20 to 25
   goals met: 2 of 8
21. (drive-truck truck1 s3 s1 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s1)
   changed: (fuel-used) from 232 to 382
   goals met: 2 of 8
22. (unload-truck package1 truck1 s1)
   deleted: (in package1 truck1)
   added: (at package1 s1)
   changed: (load truck1) from 5 to 4, (fuel-per-minute truck1) from 25 to 20
   goals met: 3 of 8
23. (unload-truck package3 truck1 s1)
   deleted: (in package3 truck1)
   added: (at package3 s1)
   changed: (load truck1) from 4 to 3, (fuel-per-minute truck1) from 20 to 16
   goals met: 4 of 8
24. (unload-truck package7 truck1 s1)
   deleted: (in package7 truck1)
   added: (at package7 s1)
   changed: (load truck1) from 3 to 2, (fuel-per-minute truck1) from 16 to 13
   goals met: 5 of 8
25. (drive-truck truck1 s1 s4 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   changed: (fuel-used) from 382 to 447
   goals met: 5 of 8
26. (drive-truck truck1 s4 s2 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   changed: (fuel-used) from 447 to 473
   goals met: 5 of 8
27. (disembark-truck driver2 truck1 s2)
   deleted: (driving driver2 truck1)
   added: (at driver2 s2) (empty truck1)
   goals met: 6 of 8
28. (unload-truck package2 truck1 s2)
   deleted: (in package2 truck1)
   added: (at package2 s2)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 7 of 8
29. (unload-truck package6 truck1 s2)
   deleted: (in package6 truck1)
   added: (at package6 s2)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 8 of 8
